{
    "description": "**Drug Summary: Mercaptopurine 50 mg**  \n- **Description**: Mercaptopurine is a yellow, round pill imprinted with \"9 3 5510\", identified as a 50 mg medication supplied by Teva Pharmaceuticals USA. It is primarily used in the treatment of Acute Lymphoblastic Leukemia and falls under the drug class of antimetabolites. The drug carries a positive evidence of human fetal risk during pregnancy and is not classified as a controlled substance.\n\n- **Interactions**: \n  - **Major Interactions**: \n    - Humira (adalimumab) \n    - Remicade (infliximab)\n  - **Moderate Interactions**: \n    - Apriso (mesalamine)\n    - Asacol (mesalamine)\n    - Lialda (mesalamine)\n    - Pentasa (mesalamine)\n\n- **Side Effects**: \n  - **More Common Side Effects**: \n    - Black, tarry stools, bleeding gums, clay-colored stools, cough or hoarseness, dark urine, decreased appetite, fever or chills, headache, loss of appetite, lower back or side pain, nausea/vomiting, painful urination, pale skin, pinpoint red spots on the skin, rash/itchy skin, stomach pain or tenderness, swelling of feet or lower legs, trouble with breathing, unusual bleeding/bruising, unusual tiredness/weakness, yellow eyes or skin.\n  - **Less Common Side Effects**: Darkening of the skin.\n  - **Incidence Not Known**: Hair loss/thinning, low sperm count.",
    "interactions": {
        "major interactions": {
            "Humira (adalimumab)": "Humira is a medicine that helps treat certain conditions like arthritis and skin issues. It works by calming the immune system to reduce inflammation and pain. It's given as an injection, usually every two weeks. Common side effects can include headaches or reactions at the injection site. Your doctor will monitor you regularly to ensure it's working well and to check for any side effects. Always report any unusual symptoms you experience.",
            "Remicade (infliximab)": "Remicade is a medicine used to treat certain autoimmune conditions, like arthritis and Crohn's disease. It helps reduce inflammation in the body, which can relieve pain and improve daily activities. The treatment is given through an IV at a healthcare facility. It's important to attend all appointments and report any unusual symptoms to your doctor."
        },
        "moderate interactions": {
            "Apriso (mesalamine)": "Apriso is a medication used to help manage conditions like ulcerative colitis, which affects your intestines. It works by reducing inflammation in your digestive system, helping to relieve symptoms like pain and diarrhea. Take it as directed by your doctor, usually once a day, and make sure to stay hydrated. If you experience any unusual side effects, contact your doctor.",
            "Asacol (mesalamine)": "Asacol is a medicine that helps reduce inflammation in the intestines. It's often used to treat conditions like ulcerative colitis. Taking Asacol can help relieve symptoms and prevent flare-ups. Make sure to take it as prescribed, drink plenty of water, and tell your doctor if you notice any side effects. Regular check-ups are also important to monitor your condition.",
            "Lialda (mesalamine)": "Lialda is a medication used to treat a condition called ulcerative colitis, which affects your intestines and can cause discomfort. It helps reduce inflammation and keeps your symptoms under control. You will take it daily, usually as a pill. Make sure to drink plenty of water and let your doctor know if you have any side effects. It’s important to take it regularly to help manage your condition better.",
            "Pentasa (mesalamine)": "Pentasa is a medication used to help treat a condition in your intestines called ulcerative colitis. It works by reducing inflammation and relieving symptoms, like stomach pain and diarrhea. You usually take it as a pill or sprinkle it on food. It's important to follow your doctor's instructions and let them know if you have any side effects or concerns while using it."
        }
    },
    "sideEffects": {
        "More common side effects": [
            "black, tarry stools",
            "bleeding gums",
            "clay colored stools",
            "cough or hoarseness",
            "dark urine",
            "decreased appetite",
            "fever or chills",
            "headache",
            "loss of appetite",
            "lower back or side pain",
            "nausea,vomiting",
            "painful or difficult urination",
            "pale skin",
            "pinpoint red spots on the skin",
            "rash,itchy skin",
            "stomach pain or tenderness",
            "swelling of the feet or lower legs",
            "trouble with breathing upon exertion",
            "unusual bleeding or bruising",
            "unusual tiredness or weakness",
            "yellow eyes or skin"
        ],
        "Less common side effects": [
            "darkening of the skin"
        ],
        "Incidence not known": [
            "hair lossor thinning of the hair",
            "low sperm count"
        ]
    }
}